#!/usr/bin/env python
# -*- coding: utf-8 -*-
#
#  kodmorsea.py

kod = {
    'a': '+-',
    'n': '-+',
    'b': '-+++',
    'o': '---',
    'c': '-+-+',
    'p': '+- - +',
    'd': '-++',
    'q': '--+-',
    'e': '+',
    'r': '+-+',
    'f': '++-+',
    's': '+++',
    'g': '--+',
    't': '-',
    'h': '++++',
    'u': '++-',
    'i': '++',
    'v': '+++-',
    'j': '+---',
    'w': '+--',
    'k': '-+-',
    'x': '-++-',
    'l': '+-++',
    'y': '-+--',
    'm': '--',
    'z': '--++',
    'ą': '+-+-',
    'ć': '-+-++',
    'ę': '++-++',
    'é': '++-++',
    'ch': '----',
    'ł': '+-++-',
    'ń': '--+--',
    'ó': '---+',
    'ś': '+++-+++',
    'ż': '--++-+',
    'ź': '--++-',
    " " :" ",
}

def koduj():
    tekst = input("podaj tekst:")
    for l in tekst:
        print(kod[l])


def dekoduj():
    

def main(args):
    koduj()
    return 0

if __name__ == '__main__':
    import sys
    sys.exit(main(sys.argv))
